import {ITask} from "../interfaces/interface";

export const taskListMocks: ITask[] = [
    {
        "id": "2024Ноябрь15",
        "year": "2024",
        "month": "Ноябрь",
        "day": "15",
        "taskString": "Баня у Степы",
        "date": new Date("2024-11-15T00:00:00.000Z")
    },
    {
        "id": "2024Ноябрь18",
        "year": "2024",
        "month": "Ноябрь",
        "day": "18",
        "taskString": "Конец отпуска, начало работы",
        "date": new Date("2024-11-18T00:00:00.000Z")
    },
    {
        "id": "2024Ноябрь22",
        "year": "2024",
        "month": "Ноябрь",
        "day": "22",
        "taskString": "Пятничный обед",
        "date": new Date("2024-11-22T00:00:00.000Z")
    },
    {
        "id": "2024Ноябрь25",
        "year": "2024",
        "month": "Ноябрь",
        "day": "25",
        "taskString": "С Левой погулять",
        "date": new Date("2024-11-25T00:00:00.000Z")
    },
    {
        "id": "2024Декабрь10",
        "year": "2024",
        "month": "Декабрь",
        "day": "10",
        "taskString": "День рождения Вити",
        "date": new Date("2024-12-10T00:00:00.000Z")
    },
    {
        "id": "2024Декабрь13",
        "year": "2024",
        "month": "Декабрь",
        "day": "13",
        "taskString": "Тимбилдинг со фронтом",
        "date": new Date("2024-12-13T00:00:00.000Z")
    },
    {
        "id": "2024Декабрь20",
        "year": "2024",
        "month": "Декабрь",
        "day": "20",
        "taskString": "Корпоратив SoftGamings",
        "date": new Date("2024-12-20T00:00:00.000Z")
    },
    {
        "id": "2024Декабрь23",
        "year": "2024",
        "month": "Декабрь",
        "day": "23",
        "taskString": "Отпускной день",
        "date": new Date("2024-12-23T00:00:00.000Z")
    },
    {
        "id": "2024Декабрь24",
        "year": "2024",
        "month": "Декабрь",
        "day": "24",
        "taskString": "Второй отпускной день",
        "date": new Date("2024-12-24T00:00:00.000Z")
    },
    {
        "id": "2024Декабрь25",
        "year": "2024",
        "month": "Декабрь",
        "day": "25",
        "taskString": "Рождество по американски",
        "date": new Date("2024-12-25T00:00:00.000Z")
    },
    {
        "id": "2024Декабрь27",
        "year": "2024",
        "month": "Декабрь",
        "day": "27",
        "taskString": "Последний рабочий день в 2024 году",
        "date": new Date("2024-12-27T00:00:00.000Z")
    }
]
